"""
                                ╔═════════════════════════════════════════════╗
                                ║             .-') _                          ║
                                ║            (  OO) )                         ║
                                ║          ,(_)----. .---. .-----.            ║
                                ║          |       |/_   |/  -.   \           ║
                                ║          '--.   /  |   |'-' _'  |           ║
                                ║          (_/   /   |   |   |_  <            ║
                                ║           /   /___ |   |.-.  |  |           ║
                                ║          |        ||   |\ `-'   /           ║
                                ║          `--------'`---' `----''     ©2021  ║
                                ╚═════════════════════════════════════════════╝
"""
import unicodedata


DECOMPOSED = [
    ['à', 'à'], ['À', 'À'],
    ['á', 'á'], ['Á', 'Á'],
    ['ã', 'ã'], ['Ã', 'Ã'],
    ['ả', 'ả'], ['Ả', 'Ả'],
    ['ạ', 'ạ'], ['Ạ', 'Ạ'],
    ['è', 'è'], ['È', 'È'],
    ['é', 'é'], ['É', 'É'],
    ['ẽ', 'ẽ'], ['Ẽ', 'Ẽ'],
    ['ẻ', 'ẻ'], ['Ẻ', 'Ẻ'],
    ['ẹ', 'ẹ'], ['Ẹ', 'Ẹ'],
    ['ì', 'ì'], ['Ì', 'Ì'],
    ['í', 'í'], ['Í', 'Í'],
    ['ĩ', 'ĩ'], ['Ĩ', 'Ĩ'],
    ['ỉ', 'ỉ'], ['Ỉ', 'Ỉ'],
    ['ị', 'ị'], ['Ị', 'Ị'],
    ['ò', 'ò'], ['Ò', 'Ò'],
    ['ó', 'ó'], ['Ó', 'Ó'],
    ['õ', 'õ'], ['Õ', 'Õ'],
    ['ỏ', 'ỏ'], ['Ỏ', 'Ỏ'],
    ['ọ', 'ọ'], ['Ọ', 'Ọ'],
    ['ờ', 'ờ'], ['Ờ', 'Ờ'],
    ['ớ', 'ớ'], ['Ớ', 'Ớ'],
    ['ỡ', 'ỡ'], ['Ỡ', 'Ỡ'],
    ['ở', 'ở'], ['Ở', 'Ở'],
    ['ợ', 'ợ'], ['Ợ', 'Ợ'],
    ['ù', 'ù'], ['Ù', 'Ù'],
    ['ú', 'ú'], ['Ú', 'Ú'],
    ['ũ', 'ũ'], ['Ũ', 'Ũ'],
    ['ủ', 'ủ'], ['Ủ', 'Ủ'],
    ['ụ', 'ụ'], ['Ụ', 'Ụ'],
    ['ỳ', 'ỳ'], ['Ỳ', 'Ỳ'],
    ['ý', 'ý'], ['Ý', 'Ý'],
    ['ỹ', 'ỹ'], ['Ỹ', 'Ỹ'],
    ['ỷ', 'ỷ'], ['Ỷ', 'Ỷ'],
    ['ỵ', 'ỵ'], ['Ỵ', 'Ỵ'],
    ['â', 'â'], ['Â', 'Â'],
    ['ầ', 'ầ'], ['Ầ', 'Ầ'],
    ['ấ', 'ấ'], ['Ấ', 'Ấ'],
    ['ẫ', 'ẫ'], ['Ẫ', 'Ẫ'],
    ['ẩ', 'ẩ'], ['Ẩ', 'Ẩ'],
    ['ậ', 'ậ'], ['Ậ', 'Ậ'],
    ['ằ', 'ằ'], ['Ằ', 'Ằ'],
    ['ắ', 'ắ'], ['Ắ', 'Ắ'],
    ['ẵ', 'ẵ'], ['Ẵ', 'Ẵ'],
    ['ẳ', 'ẳ'], ['Ẳ', 'Ẳ'],
    ['ặ', 'ặ'], ['Ặ', 'Ặ'],
    ['ừ', 'ừ'], ['Ừ', 'Ừ'],
    ['ứ', 'ứ'], ['Ứ', 'Ứ'],
    ['ữ', 'ữ'], ['Ữ', 'Ữ'],
    ['ử', 'ử'], ['Ử', 'Ử'],
    ['ự', 'ự'], ['Ự', 'Ự'],
    ['ê', 'ê'], ['Ê', 'Ê'],
    ['ề', 'ề'], ['Ề', 'Ề'],
    ['ế', 'ế'], ['Ế', 'Ế'],
    ['ễ', 'ễ'], ['Ễ', 'Ễ'],
    ['ể', 'ể'], ['Ể', 'Ể'],
    ['ệ', 'ệ'], ['Ệ', 'Ệ'],
    ['ô', 'ô'], ['Ô', 'Ô'],
    ['ồ', 'ồ'], ['Ồ', 'Ồ'],
    ['ố', 'ố'], ['Ố', 'Ố'],
    ['ỗ', 'ỗ'], ['Ỗ', 'Ỗ'],
    ['ổ', 'ổ'], ['Ổ', 'Ổ'],
    ['ộ', 'ộ'], ['Ộ', 'Ộ']
]


NORMALIZE = [
    ["òa", "oà"], ['ÒA', 'OÀ'],
    ["óa", "oá"], ['ÓA', 'OÁ'],
    ["ỏa", "oả"], ['ỎA', 'OẢ'],
    ["õa", "oã"], ['ÕA', 'OÃ'],
    ["ọa", "oạ"], ['ỌA', 'OẠ'],
    ["òe", "oè"], ['ÒE', 'OÈ'],
    ["óe", "oé"], ['ÓE', 'OÉ'],
    ["ỏe", "oẻ"], ['ỎE', 'OẺ'],
    ["õe", "oẽ"], ['ÕE', 'OẼ'],
    ["ọe", "oẹ"], ['ỌE', 'OẸ'],
    ["ùy", "uỳ"], ['ÙY', 'UỲ'],
    ["úy", "uý"], ['ÚY', 'UÝ'],
    ["ủy", "uỷ"], ['ỦY', 'UỶ'],
    ["ũy", "uỹ"], ['ŨY', 'UỸ'],
    ["ụy", "uỵ"], ['ỤY', 'UỴ'],
    ["Ủy", "Uỷ"], ['ỦY', 'UỶ']
]


SPECIAL_IA = [
    ["ia", "ia"],
    ["ía", "iá"],
    ["ìa", "ià"],
    ["ỉa", "iả"],
    ["ĩa", "iã"],
    ["ịa", "iạ"]
]


SPECIAL_UA = [
    ["ua", "ua"],
    ["úa", "uá"],
    ["ùa", "uà"],
    ["ủa", "uả"],
    ["ũa", "uã"],
    ["ụa", "uạ"]
]


def to_precomposed(text):
    for i in range(len(DECOMPOSED)):
        text = text.replace(DECOMPOSED[i][0], DECOMPOSED[i][1])
    return text


def normalize_tone_marks(text):
    # easy cases
    for i in range(len(NORMALIZE)):
        text = text.replace(NORMALIZE[i][0], NORMALIZE[i][1])
    # special cases
    words = text.split(" ")
    for j in range(len(words)):
        for i in range(len(SPECIAL_IA)):
            if words[j] == "gịa":
                break

            if SPECIAL_IA[i][0] in text:
                if words[j][0] == 'g':
                    words[j] = words[j].replace(SPECIAL_IA[i][0], SPECIAL_IA[i][1])
                    break

            if SPECIAL_IA[i][1] in text:
                if words[j][0] != 'g':
                    words[j] = words[j].replace(SPECIAL_IA[i][1], SPECIAL_IA[i][0])
                    break

            if SPECIAL_UA[i][0] in text:
                if words[j][0] == 'q':
                    words[j] = words[j].replace(SPECIAL_UA[i][0], SPECIAL_UA[i][1])
                    break

            if SPECIAL_UA[i][1] in text:
                if words[j][0] != 'q':
                    words[j] = words[j].replace(SPECIAL_UA[i][1], SPECIAL_UA[i][0])
                    break
    text = " ".join(words)
    return text


if __name__=="__main__":
    print(normalize_tone_marks("họa"))
    print(normalize_tone_marks("quá"))
    print(normalize_tone_marks("qúa"))
    print(normalize_tone_marks("múa"))
    print(normalize_tone_marks("muà"))