"""
                                ╔═════════════════════════════════════════════╗
                                ║             .-') _                          ║
                                ║            (  OO) )                         ║
                                ║          ,(_)----. .---. .-----.            ║
                                ║          |       |/_   |/  -.   \           ║
                                ║          '--.   /  |   |'-' _'  |           ║
                                ║          (_/   /   |   |   |_  <            ║
                                ║           /   /___ |   |.-.  |  |           ║
                                ║          |        ||   |\ `-'   /           ║
                                ║          `--------'`---' `----''     ©2021  ║
                                ╚═════════════════════════════════════════════╝
"""
DECOMPOSED = [
    ['à', 'à'],
    ['á', 'á'],
    ['ã', 'ã'],
    ['ả', 'ả'],
    ['ạ', 'ạ'],
    ['è', 'è'],
    ['é', 'é'],
    ['ẽ', 'ẽ'],
    ['ẻ', 'ẻ'],
    ['ẹ', 'ẹ'],
    ['ì', 'ì'],
    ['í', 'í'],
    ['ĩ', 'ĩ'],
    ['ỉ', 'ỉ'],
    ['ị', 'ị'],
    ['ò', 'ò'],
    ['ó', 'ó'],
    ['õ', 'õ'],
    ['ỏ', 'ỏ'],
    ['ọ', 'ọ'],
    ['ờ', 'ờ'],
    ['ớ', 'ớ'],
    ['ỡ', 'ỡ'],
    ['ở', 'ở'],
    ['ợ', 'ợ'],
    ['ù', 'ù'],
    ['ú', 'ú'],
    ['ũ', 'ũ'],
    ['ủ', 'ủ'],
    ['ụ', 'ụ'],
    ['ỳ', 'ỳ'],
    ['ý', 'ý'],
    ['ỹ', 'ỹ'],
    ['ỷ', 'ỷ'],
    ['ỵ', 'ỵ'],
    ['â', 'â'],
    ['ầ', 'ầ'],
    ['ấ', 'ấ'],
    ['ẫ', 'ẫ'],
    ['ẩ', 'ẩ'],
    ['ậ', 'ậ'],
    ['ằ', 'ằ'],
    ['ắ', 'ắ'],
    ['ẵ', 'ẵ'],
    ['ẳ', 'ẳ'],
    ['ặ', 'ặ'],
    ['ừ', 'ừ'],
    ['ứ', 'ứ'],
    ['ữ', 'ữ'],
    ['ử', 'ử'],
    ['ự', 'ự'],
    ['ê', 'ê'],
    ['ề', 'ề'],
    ['ế', 'ế'],
    ['ễ', 'ễ'],
    ['ể', 'ể'],
    ['ệ', 'ệ'],
    ['ô', 'ô'],
    ['ồ', 'ồ'],
    ['ố', 'ố'],
    ['ỗ', 'ỗ'],
    ['ổ', 'ổ'],
    ['ộ', 'ộ']
]


NORMALIZE = [
    ["òa", "oà"],
    ["óa", "oá"],
    ["ỏa", "oả"],
    ["õa", "oã"],
    ["ọa", "oạ"],
    ["òe", "oè"],
    ["óe", "oé"],
    ["ỏe", "oẻ"],
    ["õe", "oẽ"],
    ["ọe", "oẹ"],
    ["ùy", "uỳ"],
    ["úy", "uý"],
    ["ủy", "uỷ"],
    ["ũy", "uỹ"],
    ["ụy", "uỵ"],
    ["Ủy", "Uỷ"]
]


def to_precomposed(text):
    for i in range(len(DECOMPOSED)):
        text = text.replace(DECOMPOSED[i][0], DECOMPOSED[i][1])
    return text


def normalize_tone_marks(text):
    for i in range(len(NORMALIZE)):
        text = text.replace(NORMALIZE[i][0], NORMALIZE[i][1])
    return text
